Core/src/Catalogs/КалендарьПодготовкиОтчетности/КалендарьПодготовкиОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КалендарьПодготовкиОтчетности</name>
  <attributes>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЗадачиКалендаряПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаИнформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОбработкиСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВКалендаре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяДляИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяДляООО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Enums/ВидыЗадачСобытийКалендаря/ВидыЗадачСобытийКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗадачСобытийКалендаря</name>
  <enumValues>
    <name>ЗаполнениеДанных</name>
  </enumValues>
  <enumValues>
    <name>Отчетность</name>
  </enumValues>
  <enumValues>
    <name>НалогиИВзносы</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/КалендарьПодготовкиОтчетности/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Задача.ВидЗадачи = Перечисления.ВидыЗадачСобытийКалендаря.ЗаполнениеДанных Тогда
		Элементы.ДатаДокументаОбработкиСобытия.ТолькоПросмотр = Истина;
		Элементы.ДатаДокументаОбработкиСобытия.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ДатаДокументаОбработкиСобытия.ТолькоПросмотр = Ложь;
		Элементы.ДатаДокументаОбработкиСобытия.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачаПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ


&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	Если ПолучитьВидЗадачи(Объект.Задача) = ПредопределенноеЗначение("Перечисление.ВидыЗадачСобытийКалендаря.ЗаполнениеДанных") Тогда
		Элементы.ДатаДокументаОбработкиСобытия.ТолькоПросмотр = Истина;
		Элементы.ДатаДокументаОбработкиСобытия.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ДатаДокументаОбработкиСобытия.ТолькоПросмотр = Ложь;
		Элементы.ДатаДокументаОбработкиСобытия.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Не Объект.ПрименяетсяДляИП И Не Объект.ПрименяетсяДляООО Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='მოვლენა გამოყენებული უნდა იქნას ინდმეწარმისთვის ან შპს-ისთვის!';ru='Событие должно быть применено для ИП или ООО!'"));
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидЗадачи(Задача)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача,"ВидЗадачи")
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры
